app/controllers/attendances_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "attendances".* FROM "attendances" WHERE "attendances"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
UPDATE "attendances" SET "finished_at" = ?, "updated_at" = ? WHERE "attendances"."id" = ?  [["finished_at", "2023-06-20 07:09:00"], ["updated_at", "2023-06-20 07:09:49.347306"], ["id", 20]]
---
  def update
    @user = User.find(params[:user_id])
    @attendance = Attendance.find(params[:id])
    # 出勤時間が未登録であることを判定します。
    if @attendance.started_at.nil?
      if @attendance.update_attributes(started_at: Time.current.change(sec: 0))

SELECT "attendances".* FROM "attendances" WHERE "attendances"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "attendances" SET "started_at" = ?, "finished_at" = ?, "note" = ?, "updated_at" = ? WHERE "attendances"."id" = ?  [["started_at", "2023-06-21 13:00:00"], ["finished_at", "2023-06-21 13:15:00"], ["note", ""], ["updated_at", "2023-06-21 13:06:19.870577"], ["id", 51]]
---
  def update_one_month
  ActiveRecord::Base.transaction do
    attendances_params.each do |id, item|
      attendance = Attendance.find(id)
      attendance.editing = true
      if !attendance.update_attributes(item)

SELECT "users".* FROM "users" INNER JOIN "attendances" ON "attendances"."user_id" = "users"."id" WHERE "attendances"."started_at" = ? AND "attendances"."finished_at" IS NULL AND "attendances"."worked_on" = ?  [["started_at", "t"], ["worked_on", "2023-07-18"]]
---
  def present_employees
    @present_employees =User.joins(:attendances)
    .where.not(attendances: {
      started_at: nil
    })
    .where(attendances: {
      finished_at: nil,
      worked_on: Date.today
    })