app/controllers/bases_controller.rb

  def index
    @bases = Base.all
---
SELECT "bases".* FROM "bases"

  def create
    @base = Base.new(base_params)
    if @base.save
---
INSERT INTO "bases" ("name", "created_at", "updated_at", "base_number", "base_type") VALUES (?, ?, ?, ?, ?)  [["name", "拠点A"], ["created_at", "2023-07-22 06:57:55.207332"], ["updated_at", "2023-07-22 06:57:55.207332"], ["base_number", 2], ["base_type", "出勤"]]

  def update
    if @base.update(base_params)
---
UPDATE "bases" SET "name" = ?, "base_number" = ?, "base_type" = ?, "updated_at" = ? WHERE "bases"."id" = ?  [["name", "拠点c"], ["base_number", 55], ["base_type", "出勤"], ["updated_at", "2023-07-24 06:43:31.055747"], ["id", 10]]

  def destroy
    @base.destroy
---
DELETE FROM "bases" WHERE "bases"."id" = ?  [["id", 1]]

  def set_base
    @base = Base.find(params[:id])
---
SELECT  "bases".* FROM "bases" WHERE "bases"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]