app/controllers/users_controller.rb

 def index
  if params[:search].blank?
    @users = User.where.not(id: current_user.id).paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE (name LIKE '%田%') LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE (name LIKE '%田%')

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "department") VALUES (?, ?, ?, ?, ?, ?)

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "name" = ?, "department" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "大前田 瑛太"], ["department", ""], ["updated_at", "2023-06-21 13:10:34.614183"], ["id", 2]]

  def update_basic_info
    if @user.update_attributes(basic_info_params)
---
UPDATE "users" SET "department" = ?, "basic_time" = ?, "work_time" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["department", "本部"], ["basic_time", "2023-06-20 23:00:00"], ["work_time", "2023-06-20 22:30:00"], ["updated_at", "2023-06-21 13:45:53.949894"], ["id", 1]]